#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class GameSparks.GameSparksComponent
// 0x0028 (FullSize[0x0280] - InheritedSize[0x0258])
class UGameSparksComponent : public USceneComponent
{
public:
	struct FScriptMulticastDelegate                    OnGameSparksAvailableDelegate;                             // 0x0258(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnGameSparksDebugLog;                                      // 0x0268(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DZAB[0x8];                                     // 0x0278(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GameSparksComponent");
		return ptr;
	}



	void SetApiStage(const struct FString& stage);
	void SetApiDomain(const struct FString& domain);
	void SetApiCredential(const struct FString& credential);
	void OnGameSparksLogEvent__DelegateSignature(const struct FString& LogMessage);
	void OnGameSparksAvailable__DelegateSignature(bool available);
	void Logout();
	bool IsAvailable();
	bool IsAuthenticated();
	void Disconnect();
	void ConnectWithCredential(const struct FString& apikey, const struct FString& secret, const struct FString& credential, bool previewServer, bool clearCachedAuthentication);
	void Connect(const struct FString& apikey, const struct FString& secret, bool previewServer, bool clearCachedAuthentication);
};

// Class GameSparks.GameSparksLogEventData
// 0x00F0 (FullSize[0x0120] - InheritedSize[0x0030])
class UGameSparksLogEventData : public UObject
{
public:
	TMap<struct FString, struct FString>               m_strings;                                                 // 0x0030(0x0050) (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FString, int>                          m_numbers;                                                 // 0x0080(0x0050) (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FString, class UGameSparksScriptData*> m_objects;                                                 // 0x00D0(0x0050) (ZeroConstructor, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GameSparksLogEventData");
		return ptr;
	}



	class UGameSparksLogEventData* SetString(const struct FString& Name, const struct FString& Value);
	class UGameSparksLogEventData* SetObject(const struct FString& Name, class UGameSparksScriptData* Value);
	class UGameSparksLogEventData* SetNumber(const struct FString& Name, int Value);
	class UGameSparksLogEventData* STATIC_CreateGameSparksLogEventAttributes(class UObject* WorldContextObject);
};

// Class GameSparks.GameSparksObject
// 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
class UGameSparksObject : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnGameSparksAvailableDelegate;                             // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnGameSparksDebugLog;                                      // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GameSparksObject");
		return ptr;
	}



	void SetApiStage(const struct FString& stage);
	void SetApiDomain(const struct FString& domain);
	void SetApiCredential(const struct FString& credential);
	void OnGameSparksLogEvent__DelegateSignature(const struct FString& LogMessage);
	void OnGameSparksAvailable__DelegateSignature(bool available);
	void Logout();
	bool IsAvailable();
	bool IsAuthenticated();
	void Disconnect();
	void Connect(const struct FString& apikey, const struct FString& secret, bool previewServer, bool clearCachedAuthentication);
};

// Class GameSparks.GameSparksRequestArray
// 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
class UGameSparksRequestArray : public UObject
{
public:
	TArray<struct FString>                             StringArray;                                               // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GameSparksRequestArray");
		return ptr;
	}



	class UGameSparksRequestArray* STATIC_CreateGameSparksRequestArray(class UObject* WorldContextObject);
};

// Class GameSparks.GameSparksScriptData
// 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
class UGameSparksScriptData : public UObject
{
public:
	unsigned char                                      UnknownData_GTFL[0x10];                                    // 0x0030(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GameSparksScriptData");
		return ptr;
	}



	struct FString ToString();
	class UGameSparksScriptData* SetStringArray(const struct FString& Name, TArray<struct FString> Value);
	class UGameSparksScriptData* SetString(const struct FString& Name, const struct FString& Value);
	class UGameSparksScriptData* SetNumberArray(const struct FString& Name, TArray<int> Value);
	class UGameSparksScriptData* SetNumber(const struct FString& Name, int Value);
	class UGameSparksScriptData* SetIntArray(const struct FString& Name, TArray<int> int_value);
	class UGameSparksScriptData* SetGSDataArray(const struct FString& Name, TArray<class UGameSparksScriptData*> Value);
	class UGameSparksScriptData* SetGSData(const struct FString& Name, class UGameSparksScriptData* Value);
	class UGameSparksScriptData* SetFloatArray(const struct FString& Name, TArray<float> Value);
	class UGameSparksScriptData* SetFloat(const struct FString& Name, float Value);
	class UGameSparksScriptData* SetDateTime(const struct FString& Name, const struct FDateTime& Value);
	class UGameSparksScriptData* SetBoolean(const struct FString& Name, bool Value);
	struct FString JSONString();
	bool HasStringArray(const struct FString& Name);
	bool HasString(const struct FString& Name);
	bool HasNumberArray(const struct FString& Name);
	bool HasNumber(const struct FString& Name);
	bool HasIntArray(const struct FString& Name);
	bool HasGSDataArray(const struct FString& Name);
	bool HasGSData(const struct FString& Name);
	bool HasFloatArray(const struct FString& Name);
	bool HasFloat(const struct FString& Name);
	bool HasDateTime(const struct FString& Name);
	bool HasBoolean(const struct FString& Name);
	TArray<struct FString> GetStringArray(const struct FString& Name);
	struct FString GetString(const struct FString& Name);
	TArray<int> GetNumberArray(const struct FString& Name);
	int GetNumber(const struct FString& Name);
	TArray<struct FString> GetKeys();
	TArray<int> GetIntArray(const struct FString& Name);
	TArray<class UGameSparksScriptData*> GetGSDataArray(const struct FString& Name);
	class UGameSparksScriptData* GetGSData(const struct FString& Name);
	TArray<float> GetFloatArray(const struct FString& Name);
	float GetFloat(const struct FString& Name);
	struct FDateTime GetDateTime(const struct FString& Name);
	bool GetBoolean(const struct FString& Name);
	class UGameSparksScriptData* STATIC_CreateGameSparksScriptData(class UObject* WorldContextObject);
};

// Class GameSparks.GSAcceptChallengeRequest
// 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
class UGSAcceptChallengeRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     ChallengeInstanceId;                                       // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     Message;                                                   // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0068(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_FCY1[0x3];                                     // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0070(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAcceptChallengeRequest");
		return ptr;
	}



	class UGSAcceptChallengeRequest* STATIC_SendAcceptChallengeRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& ChallengeInstanceId, const struct FString& Message, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAcceptChallengeRequest* STATIC_SendAcceptChallengeRequest(const struct FString& ChallengeInstanceId, const struct FString& Message, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSAccountDetailsRequest
// 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
class UGSAccountDetailsRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0048(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_QQ4P[0x3];                                     // 0x0049(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAccountDetailsRequest");
		return ptr;
	}



	class UGSAccountDetailsRequest* STATIC_SendAccountDetailsRequestOnBehalfOf(const struct FString& PlayerId, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAccountDetailsRequest* STATIC_SendAccountDetailsRequest(class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSAmazonBuyGoodsRequest
// 0x0068 (FullSize[0x0098] - InheritedSize[0x0030])
class UGSAmazonBuyGoodsRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     AmazonUserId;                                              // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     CurrencyCode;                                              // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     ReceiptId;                                                 // 0x0060(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              SubUnitPrice;                                              // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               UniqueTransactionByPlayer;                                 // 0x0074(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_AH1U[0x3];                                     // 0x0075(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0078(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0080(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_EOBM[0x3];                                     // 0x0081(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0088(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAmazonBuyGoodsRequest");
		return ptr;
	}



	class UGSAmazonBuyGoodsRequest* STATIC_SendAmazonBuyGoodsRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& AmazonUserId, const struct FString& CurrencyCode, const struct FString& ReceiptId, float SubUnitPrice, bool UniqueTransactionByPlayer, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAmazonBuyGoodsRequest* STATIC_SendAmazonBuyGoodsRequest(const struct FString& AmazonUserId, const struct FString& CurrencyCode, const struct FString& ReceiptId, float SubUnitPrice, bool UniqueTransactionByPlayer, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSAmazonConnectRequest
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UGSAmazonConnectRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     AccessToken;                                               // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               DoNotCreateNewPlayer;                                      // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               DoNotLinkToCurrentPlayer;                                  // 0x0051(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               ErrorOnSwitch;                                             // 0x0052(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_GOTT[0x5];                                     // 0x0053(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UGameSparksScriptData*                       Segments;                                                  // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               SwitchIfPossible;                                          // 0x0060(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               SyncDisplayName;                                           // 0x0061(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_DQ4I[0x6];                                     // 0x0062(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_PPSO[0x3];                                     // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAmazonConnectRequest");
		return ptr;
	}



	class UGSAmazonConnectRequest* STATIC_SendAmazonConnectRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& AccessToken, bool DoNotCreateNewPlayer, bool DoNotLinkToCurrentPlayer, bool ErrorOnSwitch, class UGameSparksScriptData* Segments, bool SwitchIfPossible, bool SyncDisplayName, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAmazonConnectRequest* STATIC_SendAmazonConnectRequest(const struct FString& AccessToken, bool DoNotCreateNewPlayer, bool DoNotLinkToCurrentPlayer, bool ErrorOnSwitch, class UGameSparksScriptData* Segments, bool SwitchIfPossible, bool SyncDisplayName, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSAnalyticsRequest
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UGSAnalyticsRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGameSparksScriptData*                       Data;                                                      // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               End;                                                       // 0x0048(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_8SDO[0x7];                                     // 0x0049(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     Key;                                                       // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Start;                                                     // 0x0060(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_K3Z2[0x7];                                     // 0x0061(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_9WIZ[0x3];                                     // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAnalyticsRequest");
		return ptr;
	}



	class UGSAnalyticsRequest* STATIC_SendAnalyticsRequestOnBehalfOf(const struct FString& PlayerId, class UGameSparksScriptData* Data, bool End, const struct FString& Key, bool Start, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAnalyticsRequest* STATIC_SendAnalyticsRequest(class UGameSparksScriptData* Data, bool End, const struct FString& Key, bool Start, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSAroundMeLeaderboardRequest
// 0x0090 (FullSize[0x00C0] - InheritedSize[0x0030])
class UGSAroundMeLeaderboardRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     ChallengeInstanceId;                                       // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       CustomIdFilter;                                            // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               DontErrorOnNotSocial;                                      // 0x0058(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_BMGX[0x3];                                     // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                EntryCount;                                                // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksRequestArray*                     FriendIds;                                                 // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                IncludeFirst;                                              // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                IncludeLast;                                               // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               InverseSocial;                                             // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_YZAR[0x7];                                     // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     LeaderboardShortCode;                                      // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Social;                                                    // 0x0088(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_3L3N[0x7];                                     // 0x0089(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UGameSparksRequestArray*                     TeamIds;                                                   // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksRequestArray*                     TeamTypes;                                                 // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x00A0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x00A8(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_FQZ4[0x3];                                     // 0x00A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x00AC(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x00B0(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAroundMeLeaderboardRequest");
		return ptr;
	}



	class UGSAroundMeLeaderboardRequest* STATIC_SendAroundMeLeaderboardRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& ChallengeInstanceId, class UGameSparksScriptData* CustomIdFilter, bool DontErrorOnNotSocial, int EntryCount, class UGameSparksRequestArray* FriendIds, int IncludeFirst, int IncludeLast, bool InverseSocial, const struct FString& LeaderboardShortCode, bool Social, class UGameSparksRequestArray* TeamIds, class UGameSparksRequestArray* TeamTypes, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAroundMeLeaderboardRequest* STATIC_SendAroundMeLeaderboardRequest(const struct FString& ChallengeInstanceId, class UGameSparksScriptData* CustomIdFilter, bool DontErrorOnNotSocial, int EntryCount, class UGameSparksRequestArray* FriendIds, int IncludeFirst, int IncludeLast, bool InverseSocial, const struct FString& LeaderboardShortCode, bool Social, class UGameSparksRequestArray* TeamIds, class UGameSparksRequestArray* TeamTypes, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSAuthenticationRequest
// 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
class UGSAuthenticationRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     Password;                                                  // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     Username;                                                  // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0068(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_MBAX[0x3];                                     // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0070(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSAuthenticationRequest");
		return ptr;
	}



	class UGSAuthenticationRequest* STATIC_SendAuthenticationRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& Password, const struct FString& Username, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSAuthenticationRequest* STATIC_SendAuthenticationRequest(const struct FString& Password, const struct FString& Username, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSBatchAdminRequest
// 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
class UGSBatchAdminRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGameSparksRequestArray*                     playerIds;                                                 // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       Request;                                                   // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0058(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_RMGF[0x3];                                     // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSBatchAdminRequest");
		return ptr;
	}



	class UGSBatchAdminRequest* STATIC_SendBatchAdminRequest(class UGameSparksRequestArray* playerIds, class UGameSparksScriptData* Request, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSBuyVirtualGoodsRequest
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UGSBuyVirtualGoodsRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     CurrencyShortCode;                                         // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                CurrencyType;                                              // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Quantity;                                                  // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     ShortCode;                                                 // 0x0058(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_PTC9[0x3];                                     // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSBuyVirtualGoodsRequest");
		return ptr;
	}



	class UGSBuyVirtualGoodsRequest* STATIC_SendBuyVirtualGoodsRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& CurrencyShortCode, int CurrencyType, int Quantity, const struct FString& ShortCode, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSBuyVirtualGoodsRequest* STATIC_SendBuyVirtualGoodsRequest(const struct FString& CurrencyShortCode, int CurrencyType, int Quantity, const struct FString& ShortCode, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSCancelBulkJobAdminRequest
// 0x0028 (FullSize[0x0058] - InheritedSize[0x0030])
class UGSCancelBulkJobAdminRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGameSparksRequestArray*                     BulkJobIds;                                                // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_O958[0x3];                                     // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSCancelBulkJobAdminRequest");
		return ptr;
	}



	class UGSCancelBulkJobAdminRequest* STATIC_SendCancelBulkJobAdminRequest(class UGameSparksRequestArray* BulkJobIds, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSChangeUserDetailsRequest
// 0x0080 (FullSize[0x00B0] - InheritedSize[0x0030])
class UGSChangeUserDetailsRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     DisplayName;                                               // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     Language;                                                  // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     NewPassword;                                               // 0x0060(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     OldPassword;                                               // 0x0070(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     Username;                                                  // 0x0080(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0098(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_7QV7[0x3];                                     // 0x0099(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x00A0(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSChangeUserDetailsRequest");
		return ptr;
	}



	class UGSChangeUserDetailsRequest* STATIC_SendChangeUserDetailsRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& DisplayName, const struct FString& Language, const struct FString& NewPassword, const struct FString& OldPassword, const struct FString& Username, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSChangeUserDetailsRequest* STATIC_SendChangeUserDetailsRequest(const struct FString& DisplayName, const struct FString& Language, const struct FString& NewPassword, const struct FString& OldPassword, const struct FString& Username, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSChatOnChallengeRequest
// 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
class UGSChatOnChallengeRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     ChallengeInstanceId;                                       // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     Message;                                                   // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0068(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_5WW3[0x3];                                     // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0070(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSChatOnChallengeRequest");
		return ptr;
	}



	class UGSChatOnChallengeRequest* STATIC_SendChatOnChallengeRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& ChallengeInstanceId, const struct FString& Message, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSChatOnChallengeRequest* STATIC_SendChatOnChallengeRequest(const struct FString& ChallengeInstanceId, const struct FString& Message, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSConsumeVirtualGoodRequest
// 0x0048 (FullSize[0x0078] - InheritedSize[0x0030])
class UGSConsumeVirtualGoodRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int                                                Quantity;                                                  // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_W2WN[0x4];                                     // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     ShortCode;                                                 // 0x0048(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0060(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_6H72[0x3];                                     // 0x0061(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0068(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSConsumeVirtualGoodRequest");
		return ptr;
	}



	class UGSConsumeVirtualGoodRequest* STATIC_SendConsumeVirtualGoodRequestOnBehalfOf(const struct FString& PlayerId, int Quantity, const struct FString& ShortCode, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSConsumeVirtualGoodRequest* STATIC_SendConsumeVirtualGoodRequest(int Quantity, const struct FString& ShortCode, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSCreateChallengeRequest
// 0x00D8 (FullSize[0x0108] - InheritedSize[0x0030])
class UGSCreateChallengeRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     AccessType;                                                // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               AutoStartJoinedChallengeOnMaxPlayers;                      // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_5318[0x7];                                     // 0x0051(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     ChallengeMessage;                                          // 0x0058(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     ChallengeShortCode;                                        // 0x0068(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Currency1Wager;                                            // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Currency2Wager;                                            // 0x007C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Currency3Wager;                                            // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Currency4Wager;                                            // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Currency5Wager;                                            // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Currency6Wager;                                            // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       CurrencyWagers;                                            // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       EligibilityCriteria;                                       // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     endTime;                                                   // 0x00A0(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     ExpiryTime;                                                // 0x00B0(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                MaxAttempts;                                               // 0x00C0(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                MaxPlayers;                                                // 0x00C4(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                MinPlayers;                                                // 0x00C8(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Silent;                                                    // 0x00CC(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_1NFL[0x3];                                     // 0x00CD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     startTime;                                                 // 0x00D0(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksRequestArray*                     UsersToChallenge;                                          // 0x00E0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x00E8(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x00F0(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_T5BJ[0x3];                                     // 0x00F1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x00F4(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x00F8(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSCreateChallengeRequest");
		return ptr;
	}



	class UGSCreateChallengeRequest* STATIC_SendCreateChallengeRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& AccessType, bool AutoStartJoinedChallengeOnMaxPlayers, const struct FString& ChallengeMessage, const struct FString& ChallengeShortCode, int Currency1Wager, int Currency2Wager, int Currency3Wager, int Currency4Wager, int Currency5Wager, int Currency6Wager, class UGameSparksScriptData* CurrencyWagers, class UGameSparksScriptData* EligibilityCriteria, const struct FString& endTime, const struct FString& ExpiryTime, int MaxAttempts, int MaxPlayers, int MinPlayers, bool Silent, const struct FString& startTime, class UGameSparksRequestArray* UsersToChallenge, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSCreateChallengeRequest* STATIC_SendCreateChallengeRequest(const struct FString& AccessType, bool AutoStartJoinedChallengeOnMaxPlayers, const struct FString& ChallengeMessage, const struct FString& ChallengeShortCode, int Currency1Wager, int Currency2Wager, int Currency3Wager, int Currency4Wager, int Currency5Wager, int Currency6Wager, class UGameSparksScriptData* CurrencyWagers, class UGameSparksScriptData* EligibilityCriteria, const struct FString& endTime, const struct FString& ExpiryTime, int MaxAttempts, int MaxPlayers, int MinPlayers, bool Silent, const struct FString& startTime, class UGameSparksRequestArray* UsersToChallenge, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSCreateTeamRequest
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UGSCreateTeamRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     TeamId;                                                    // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     TeamName;                                                  // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     TeamType;                                                  // 0x0060(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0070(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0078(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_LJNA[0x3];                                     // 0x0079(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x007C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     PlayerId;                                                  // 0x0080(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("Class GameSparks.GSCreateTeamRequest");
		return ptr;
	}



	class UGSCreateTeamRequest* STATIC_SendCreateTeamRequestOnBehalfOf(const struct FString& PlayerId, const struct FString& TeamId, const struct FString& TeamName, const struct FString& TeamType, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
	class UGSCreateTeamRequest* STATIC_SendCreateTeamRequest(const struct FString& TeamId, const struct FString& TeamName, const struct FString& TeamType, class UGameSparksScriptData* ScriptData, bool Durable, int requestTimeoutSeconds);
};

// Class GameSparks.GSDeclineChallengeRequest
// 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
class UGSDeclineChallengeRequest : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnResponse;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     ChallengeInstanceId;                                       // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FString                                     Message;                                                   // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSparksScriptData*                       ScriptData;                                                // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               Durable;                                                   // 0x0068(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_VMU1[0x3];                                     // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                requestTimeoutSeconds;                                     // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
