#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Jane_AnimBlueprint.Jane_AnimBlueprint_C
// 0x1B08 (FullSize[0x1D70] - InheritedSize[0x0268])
class UJane_AnimBlueprint_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_3QFL[0x8];                                     // 0x0268(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0270(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B2DAFDC2483F5C44492F9A88AD068B4F; // 0x0280(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0AD59F8240AFA0B70A0FBCBE699DD273; // 0x02A8(0x00B8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2A69C6A44493253F5241DFA650A68939; // 0x0360(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_950D5C174D704EEEE6DC3296E8308E4D; // 0x0418(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F1A9488346609989279DBC8A0BB6D263; // 0x0440(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B7CAA7D7459681B72C5D858473B463B8; // 0x04F8(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_83F83D5A4ABF84058C4CBFA77E46490C;       // 0x05B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8B9A3BA405E2CD9DE32FABAD1E8F8C8; // 0x05F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE5695B14DA172FDCF79108F0471CE76; // 0x0620(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C03CCAA0488E36FB94E0C89DEF96AEB0; // 0x0648(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_943B35FF40C9A3649443559A5489B546; // 0x0670(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1BA648ED42E2A8C63354DEA104436E0F; // 0x0698(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E587ACF94659C05AB91BDFB5471323DD; // 0x06C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88ECF032473E4F9CB06674BE482960B4; // 0x06E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8EF73B24F0A08F599D38FBB39206F87; // 0x0710(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45011576415BF94B28EC85932BF323FB; // 0x0738(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46209F3746B5AAD5CA5C1DA1B76008C7; // 0x0760(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39F642D746A3A153E6DB68A49FCF9B59; // 0x0788(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF3546E74C2392AB6E2F8A936706B615; // 0x07B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86A693BD4D4ABF9B996AF99C14FA1DE6; // 0x07D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2AED3E0448DF0DCFB87D28803810D24F; // 0x0800(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D7EA9FA473AD37A1959D19E11780C74; // 0x0828(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_424C94864F5E4C76A09A91A741520064; // 0x0850(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53E2D15940724AC35504E6AEB48B7EA9; // 0x0878(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2B2FB034C4C9A923286329DEDEFD701; // 0x08A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E64FAD264762FB77B32332B5335C393E; // 0x08C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3271F7124D4A46A484AD05A966692B47; // 0x08F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B6222DE47E4329F3F9669830D908658; // 0x0918(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BEECE0D04BFD8FACB7999E9D5253ED45; // 0x0940(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_663242D247742E431831F49B78DDC4CD; // 0x0968(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3BF4588A4B98BED767E529914DF58D33; // 0x0990(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90EB318A427B4FF54244A39EB5707F83; // 0x09B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E3CA93041ACE9F5515B459238E2FDF6; // 0x09E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C01944D48D2D42E49A81CB7ECAB12CE; // 0x0A08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52F7B6254C0AF1950387E6AB5271CE18; // 0x0A30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2137824144211B228FE36993C70B5839; // 0x0A58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DDC62E04DB22A471B7536B13551B483; // 0x0A80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_822D86F34913385DAF4EC6B205CCCAF3; // 0x0AA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA029CE64A91B9D0D3D30B947A45D6BB; // 0x0AD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB01B2044736E7A5F67481A29FAF5097; // 0x0AF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B768672F405D118E45EC35BCD9859A53; // 0x0B20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DBE625940A2561BFEB84E9582CB0B25; // 0x0B48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89AD899748BF3245CCFAA0AB73BE638D; // 0x0B70(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63A0B1AA4EC72018AA7B47A336754829; // 0x0B98(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_501388C14A118CD358DC8CA095764BF5; // 0x0BC0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0DDFA8348E6A01A47AE218AF40BEB98; // 0x0BE8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB56F3EB4C085B118E8EDAB60CC550B2; // 0x0C10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B4746A041F1545E1C3219A88E282649; // 0x0C38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F07080024C8652AAC6666A93E8AEAF41; // 0x0C60(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE964C9646CEFB6D6AF6FCBDFB25D0CA; // 0x0C88(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5D16613A42F4C334683CEA8D2585ACC2; // 0x0D00(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D501EDF040F05183A1567591C2C51D92; // 0x0DB8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_98C89E9545D870E12D692CA4693AFC64; // 0x0E98(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C055095F4BEF3CF6422BD1915AEA4881; // 0x0EB8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_153A0B264C7DFAED3C2C78A5C2F452F3; // 0x0F30(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B07AF99546E5C471CFB07189252B92A8; // 0x0F50(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B7340EB341234EF1943C1FAB65B4A1B1; // 0x0FC8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ECFE8FE444526E22C93F1B84115C44B2; // 0x0FE8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_562F5302458CEF4532B3FBACC3908875; // 0x1060(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4A763F1F450395C73EA496912154CF86; // 0x1118(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BF1C273242EEFFFE9EEC55AC44376A83; // 0x11F8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C10D82A48BD9CA3BC6A86B35973D33B; // 0x1218(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5AD4C5144E4C7E4B6E845CBD5CC042D1; // 0x1290(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B7602A8F4FEAE02BC0C5A393BF646741; // 0x12B0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_46796CF9473236F647459CAB72ED894E; // 0x1390(0x0020)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_46CD574349299A6CBE5E59B260AC9D5D; // 0x13B0(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FE0AA7C444C1F3A6A82C09841DDB7B30; // 0x1478(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0C3FE7EB4A7EDD43347032BD15D0C2A8; // 0x1558(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4504267B463DD0C4EE9566AA12EEDE55; // 0x15D0(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DAA903F846C5AEA42985BFB0511D231B; // 0x15F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B22FEB042D8E6F594DD47855BE395E3; // 0x1618(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D99F073B4D2358BC316A0CB2894F0D58; // 0x1640(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_447905D14B5A711349E51FB137608175; // 0x16B8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E62999B14C39632531D30F8878F269D7; // 0x16D8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_03B794584DD71EE513DDEAB6C8B2C702; // 0x1750(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9093191642354779F46166A5B37F9036; // 0x1770(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B52162624CBF05F991526491DEF63BC1; // 0x17E8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6D3E486045B793FEDD1689898262DD87; // 0x1808(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C4C9AD5943F3B8C9586DFEBA7C8EBD82; // 0x18B8(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_37F7CD84446CD9222FAD91959738FDB7; // 0x18D8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9B2527B74788234CB3696EAE40E2A127; // 0x19B8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_00CC1DBD441F4A74E4CE5A9359B2CA86; // 0x19D8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_Root_BBF02A564EA7AB011677F99C47FC64A2;       // 0x1A88(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F050B57B46E72F3FE295E286AC5498F6; // 0x1AA8(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DA00AB9349DE87483A0987A2169D0D33;       // 0x1AD0(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_831BAAFD4CA8ED225B27FC968989296E; // 0x1B18(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_563F5B0644846BD2932FB9879B870A48; // 0x1BD0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FCB93E8B4F38776BF40B9D861718573F; // 0x1C88(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_75456AE54E82A71A3FE408BF0A760E94; // 0x1CB0(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FED653E148EF43BEB9011CAE4119F64D;       // 0x1CD8(0x0048)
	float                                              MoveForward;                                               // 0x1D20(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              MoveRight;                                                 // 0x1D24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsInAir;                                                   // 0x1D28(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_F5UY[0x3];                                     // 0x1D29(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Pitch;                                                     // 0x1D2C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Roll;                                                      // 0x1D30(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Yaw;                                                       // 0x1D34(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    RotationLastTick;                                          // 0x1D38(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              YawDelta;                                                  // 0x1D44(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsAccelerating;                                            // 0x1D48(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_Y27E[0x7];                                     // 0x1D49(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UObject*                                     Character;                                                 // 0x1D50(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsAttacking;                                               // 0x1D58(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_W2NF[0x3];                                     // 0x1D59(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                CurrentAttack;                                             // 0x1D5C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               FullBody;                                                  // 0x1D60(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsCrouch;                                                  // 0x1D61(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsKnockdown;                                               // 0x1D62(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsInjured;                                                 // 0x1D63(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsWorship;                                                 // 0x1D64(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsSearch;                                                  // 0x1D65(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_7ZQ5[0x2];                                     // 0x1D66(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ASurvivorBase_C*                             Survivor_Ref;                                              // 0x1D68(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("AnimBlueprintGeneratedClass Jane_AnimBlueprint.Jane_AnimBlueprint_C");
		return ptr;
	}



	void Set_MoveAxis_From_Transform_Direction(class AActor* Pawn_, class USceneComponent* Camera, float* MoveForward, float* MoveRight);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_822D86F34913385DAF4EC6B205CCCAF3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_52F7B6254C0AF1950387E6AB5271CE18();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_BF3546E74C2392AB6E2F8A936706B615();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_63A0B1AA4EC72018AA7B47A336754829();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_88ECF032473E4F9CB06674BE482960B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_90EB318A427B4FF54244A39EB5707F83();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_1BA648ED42E2A8C63354DEA104436E0F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_943B35FF40C9A3649443559A5489B546();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_C03CCAA0488E36FB94E0C89DEF96AEB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_663242D247742E431831F49B78DDC4CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_EE5695B14DA172FDCF79108F0471CE76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_E8B9A3BA405E2CD9DE32FABAD1E8F8C8();
	void AnimNotify_EndAttack();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_6B6222DE47E4329F3F9669830D908658();
	void AnimNotify_FreeFall();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Jane_AnimBlueprint_AnimGraphNode_TransitionResult_53E2D15940724AC35504E6AEB48B7EA9();
	void ExecuteUbergraph_Jane_AnimBlueprint(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
