#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_HunterSlot.S_HunterSlot
// 0x0070
struct FS_HunterSlot
{
	struct FPrimaryAssetId                             Character_17_1B57D7B14DA286A19CECF989EFCC69B4;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             PerkPassiveSlot_1_22_445C95EA42FAA332C6D5CC8F997D9D7E;     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             PerkPassiveSlot_2_25_A6C9A5974D076DA366D3C58B03B46FD2;     // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Hat_19_32B297A24FE91637253EB9B72BE3235B;          // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Cloth_30_FA23005942BAE9C2FE7F748F87F68596;        // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Backed_29_3D59A38545E6D3CE265A9C913FE907BB;       // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Weapon_21_7E5FD5AE4447C43E0C82EBA86B5DCD12;       // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
