#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_LootboxProduct.S_LootboxProduct
// 0x00D0
struct FS_LootboxProduct
{
	struct FText                                       Name_54_773C1026455B7626A498BF9ECC09137A;                  // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FSlateBrush                                 Image_69_B665C85E41D25F4839A3CFB030161BA8;                 // 0x0018(0x0088) (Edit, BlueprintVisible)
	struct FText                                       Type_65_8F44E01146D108BA16A62AB445276373;                  // 0x00A0(0x0018) (Edit, BlueprintVisible)
	int                                                Rarity_64_11FC133C467CEC13F9FAB180AA118721;                // 0x00B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Rate_63_7B993C3E41B193AC2977D596E5BB37AD;                  // 0x00BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             AssetId_72_DB628CE245B1F02F37A7F18187B4CC29;               // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
