#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_PlayerProfile.S_PlayerProfile
// 0x00B0
struct FS_PlayerProfile
{
	struct FSlateBrush                                 Avatar_15_E3775F4A417E1C21299BAB8A2F22299B;                // 0x0000(0x0088) (Edit, BlueprintVisible)
	struct FText                                       Name_8_69990D714492C61BD1B4C7BABA278D31;                   // 0x0088(0x0018) (Edit, BlueprintVisible)
	int                                                Level_10_B9DAE06347CFC330C0629F8C928F0B81;                 // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Coin_13_9973198647F499F2E92C8087F141AED4;                  // 0x00A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Token_19_4A53C5354FDC1EC5F1045AA521243282;                 // 0x00A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Gem_17_909025B0435DB84E6AB919A3B67EA090;                   // 0x00AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
