#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_SummaryResult.S_SummaryResult
// 0x0130
struct FS_SummaryResult
{
	struct FPlayerInfoStruct_G                         playerInfo_28_2E3BDABA4DA282EE4ABDF49C66BF8C2A;            // 0x0000(0x0110) (Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FS_Activity>                         activities_34_CDE64A1B4B555D75143D2C83430805BA;            // 0x0110(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                totalScore_13_256117544C4B8E2DA9283D8DC4A3FB7A;            // 0x0120(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                totalCoin_30_1F2E46254A800A27F522239B6463D0F7;             // 0x0124(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              totalExp_32_AFE9548047C1B5646D53D9A9613A42E6;              // 0x0128(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                mmrPoint_39_E25A7DC84EA451C55015AF9D10699BEC;              // 0x012C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
