#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_SurvivorSlot.S_SurvivorSlot
// 0x0080
struct FS_SurvivorSlot
{
	struct FPrimaryAssetId                             Character_17_1B57D7B14DA286A19CECF989EFCC69B4;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             PerkPassiveSlot_1_23_445C95EA42FAA332C6D5CC8F997D9D7E;     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             PerkPassiveSlot_2_25_5D48735B45EE83F7FDA5EDBF1A390816;     // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             PerkPassiveSlot_3_28_11A806324ECD3976F013488CB656712B;     // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Hat_19_32B297A24FE91637253EB9B72BE3235B;          // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Cloth_31_FA23005942BAE9C2FE7F748F87F68596;        // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Cosmetic_Backed_36_F33E635E411717EB81BB1885AA267EAB;       // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                             Item_29_7E5FD5AE4447C43E0C82EBA86B5DCD12;                  // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
