#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_TutorialEvent.S_TutorialEvent
// 0x0023
struct FS_TutorialEvent
{
	struct FString                                     Action_13_1486B6F44757D799DD6AE7BE4F551BF0;                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FS_TutorialData>                     Data_6_ED6DCEFC4DC606A30B1E6595765B9B73;                   // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               ForceShow_10_9B3533F34C4EA47814CE6D953115F7FB;             // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               CanRepeatedly_17_CCEE204145FB0AEAC3D820964790670A;         // 0x0021(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               bIsDeprecate_19_601FADE04BCFE240E6D4E6914C109073;          // 0x0022(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
