#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Tim_AnimBlueprint.Tim_AnimBlueprint_C
// 0x1A50 (FullSize[0x1CB8] - InheritedSize[0x0268])
class UTim_AnimBlueprint_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_QQZ3[0x8];                                     // 0x0268(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0270(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0C4A0F804392C9E358221C90DB2B79DE; // 0x0280(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2201EE4C4F6BD6A131C396B46FAFD1D5; // 0x0338(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C9DB693341A6A30F3809EDA0E5427130; // 0x0360(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EE7F239741F22BFF7C39A88801F54CDB; // 0x0418(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7EF0392240D1235DFACBA6A0BE036031; // 0x0440(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_39FB48EE41EEEE683E11588F6424E42A;       // 0x04F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B76850F4811A88C2C11E8A579EB1397; // 0x0540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A63DA944B5F8928ACE1ABA5259BD989; // 0x0568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_182B74D94DFA5DDC933612B383D12026; // 0x0590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3598C42841497EDBE2A80683B6774693; // 0x05B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81C041454E4E9FA2EB9B1E81BAACDADF; // 0x05E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E06A5A204FAF15B35C27B1A100C3F9C3; // 0x0608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFB5A0244749AB4FC4B122886ED545C3; // 0x0630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1D04DC5499155755C416DB7F8E772FD; // 0x0658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_447C744542ECC886D659FF874C9DFD56; // 0x0680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEA899DA44D4B1E2960F1EAE223B226C; // 0x06A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AA05697450097D78DE277AC6CD9D979; // 0x06D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_07DE7F0B4A2131493AB46B8F31CDF04A; // 0x06F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0D617F542666D39E27129891BAF87F8; // 0x0720(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6A79395492311DAC835068DB8BE3670; // 0x0748(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4850E5D74C29C085D5A8A99354965AF6; // 0x0770(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EDD687CA468FE40CD868D4962A46E2A2; // 0x0798(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_843BCE5847A9FCCE07C7EA93D9C6E6D9; // 0x07C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_436DBEF74FF0BA963D6F7795B25DC425; // 0x07E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_167D154A4C3143B9834C7C8D313E42B1; // 0x0810(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E3AE14F4BBFACCF76267E936FE99CBC; // 0x0838(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC89517E47D716C3A25308878B5F16A2; // 0x0860(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB8627234050768F8596D1B94368AAC3; // 0x0888(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_196E067E4D8A8B5B34F785B76CD51745; // 0x08B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91BDCA7D4CAD59A1B17E29944CB9FA09; // 0x08D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2AC43E2C4CAD7ED35FC9D4A44772C156; // 0x0900(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF46958F4B9DAE4FA479CE8A1E685F07; // 0x0928(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D8737B894F626DF89A0C67A444EBBF5C; // 0x0950(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F26A337B405952A7086C4597EC7184B8; // 0x0978(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46973F8445ED2186E3BBAB943798FA21; // 0x09A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_596A2F484C5AF9EA553DAFB456C6227F; // 0x09C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67D9ECED4F9D6CBBE07DF98FACBC3D6F; // 0x09F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F4BF1B848EDBDE4BCD10B902E7F9280; // 0x0A18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA8E381D4A3276FC8E67928871612754; // 0x0A40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD999C23449A5BE7049D1B821B7715A5; // 0x0A68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B64A4F7244F5DC34FBB370AC312EA463; // 0x0A90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C7450E2A4A345D1CAB5FAAB7833081C7; // 0x0AB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_914074DA4299DD816FFA3D8F48ACF6F0; // 0x0AE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3EE3C8DE46C8E624EFEADEA384AA65F3; // 0x0B08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DAC3AB5D4CC7F268E80DE997B03A374D; // 0x0B30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A7E7413448D488659D19709635E6B245; // 0x0B58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4B3FCFD4AFDCA4DF7F203A03E3518C1; // 0x0B80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22AD4B5A49D5F630453B6590D9DC211C; // 0x0BA8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2CCBC2864288B0F01A581D831474F2C3; // 0x0BD0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_95F62F43446EE40B1B1779AE11B82D6D; // 0x0C48(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3FD4F0FD4F53B8A0C311498E28513841; // 0x0D00(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3EA0B79B427C935AEC4504926ED44803; // 0x0DE0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8466D231409446C84D556891DC04610D; // 0x0E00(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3E7426A1475B0EE0525B0AAE768EEFB5; // 0x0E78(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7FB6199E4C630C9BD4207788FF4CAA3C; // 0x0E98(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9BBA934D4AC7CFE7798117A46CC532F6; // 0x0F10(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_53FDEF9D44F2D9539AEA2DADA912CEC6; // 0x0F30(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1703DF4D4BAA94FA25DA179FF66073AC; // 0x0FA8(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5436A8554A149FC7C52F7E8BC60752F8; // 0x1060(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_566FEF004AEEDA547DAE5CAF9B55DC9C; // 0x1140(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6FB5036C4C5FBDB1723DED9F8B6B1F68; // 0x1160(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B0A716584E161BA7157B7EB5FC122AE6; // 0x11D8(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CEF89F2941F08389244F6EB49C25127D; // 0x11F8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0C27F7B84ABF7FCA0095EC9600CA2544; // 0x12D8(0x0020)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_E294AFCE4C53AD8A92EC2980C5833406; // 0x12F8(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E80C8FEF4EF61005113EB492ACA46031; // 0x13C0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AE123597479F0CFD7766E2BB7E94CCCA; // 0x14A0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A15EF41D45EA10F97AF05FBE0E9C9BA1; // 0x1518(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47DC5BB148D8E5658B1F2E9501CB49C1; // 0x1538(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55C1862D420AD9D54F68AE8C6F315A7D; // 0x1560(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ABC2DE2C4162F9CA2190A3B292076EFA; // 0x1588(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_406D63244EFB7247E5FA558588EB8193; // 0x1600(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A51B46B143CF4724C5AC0499B28455A0; // 0x1620(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DDA169E94648453FD5AFB98DB883BD60; // 0x1698(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6DFC76ED4345B710AC0530A564734449; // 0x16B8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4BA99FBE46AE6E63B0D29BB00B0C87B7; // 0x1730(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_48FCB22842FD79B9AF9C57A88FB63280; // 0x1750(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0620E24F47B2C7AFDDF5B88C31076E8E; // 0x1800(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_37AFFAE24F5B8AA892ADDAB23AC1014E; // 0x1820(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_518AF82047105DB477100F9D28C59463; // 0x1900(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3545A93B457942B5C862389941ED9813; // 0x1920(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_Root_94BF91394D26EC7F51456ABB27C4D96D;       // 0x19D0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B6D0CA364C9BF4733F11B5A6B0BED3DF; // 0x19F0(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E0315635450DB2343BB5929753309C22;       // 0x1A18(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F8E2A4CB447F4985B744B4BEBA2CDC64; // 0x1A60(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_EBD35D5F46DE9F0DD16047B35534B8EA; // 0x1B18(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E55EFBF145B21DC0D94332942E22E7A4; // 0x1BD0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_48CA36E44FFCD7EAEBB384B8937CE21C; // 0x1BF8(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_56411FAB4304868DAD89EB958B27440F;       // 0x1C20(0x0048)
	float                                              MoveForward;                                               // 0x1C68(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              MoveRight;                                                 // 0x1C6C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsInAir;                                                   // 0x1C70(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_G1TH[0x3];                                     // 0x1C71(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Pitch;                                                     // 0x1C74(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Roll;                                                      // 0x1C78(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Yaw;                                                       // 0x1C7C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    RotationLastTick;                                          // 0x1C80(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              YawDelta;                                                  // 0x1C8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsAccelerating;                                            // 0x1C90(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_LK5Z[0x7];                                     // 0x1C91(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UObject*                                     Character;                                                 // 0x1C98(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsAttacking;                                               // 0x1CA0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_VKBY[0x3];                                     // 0x1CA1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                CurrentAttack;                                             // 0x1CA4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               FullBody;                                                  // 0x1CA8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsCrouch;                                                  // 0x1CA9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsKnockdown;                                               // 0x1CAA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsInjured;                                                 // 0x1CAB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsWorship;                                                 // 0x1CAC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsSearch;                                                  // 0x1CAD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_QMVU[0x2];                                     // 0x1CAE(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ASurvivorBase_C*                             Survivor_Ref;                                              // 0x1CB0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("AnimBlueprintGeneratedClass Tim_AnimBlueprint.Tim_AnimBlueprint_C");
		return ptr;
	}



	void Set_MoveAxis_From_Transform_Direction(class AActor* Pawn_, class USceneComponent* Camera, float* MoveForward, float* MoveRight);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_67D9ECED4F9D6CBBE07DF98FACBC3D6F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_F26A337B405952A7086C4597EC7184B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_07DE7F0B4A2131493AB46B8F31CDF04A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_914074DA4299DD816FFA3D8F48ACF6F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_DFB5A0244749AB4FC4B122886ED545C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_2AC43E2C4CAD7ED35FC9D4A44772C156();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_81C041454E4E9FA2EB9B1E81BAACDADF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_3598C42841497EDBE2A80683B6774693();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_196E067E4D8A8B5B34F785B76CD51745();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_182B74D94DFA5DDC933612B383D12026();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_4A63DA944B5F8928ACE1ABA5259BD989();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_0B76850F4811A88C2C11E8A579EB1397();
	void AnimNotify_EndAttack();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_FC89517E47D716C3A25308878B5F16A2();
	void AnimNotify_FreeFall();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tim_AnimBlueprint_AnimGraphNode_TransitionResult_843BCE5847A9FCCE07C7EA93D9C6E6D9();
	void ExecuteUbergraph_Tim_AnimBlueprint(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
