#pragma once

// Name: hsh, Version: 2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// WidgetBlueprintGeneratedClass Widget_MainMenuGSMobile.Widget_MainMenuGSMobile_C
// 0x0151 (FullSize[0x0391] - InheritedSize[0x0240])
class UWidget_MainMenuGSMobile_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0240(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                      Background;                                                // 0x0250(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                     Button_2;                                                  // 0x0258(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                     Button_Create;                                             // 0x0260(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                     Button_Join;                                               // 0x0268(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                                   CheckBox_IsLocal;                                          // 0x0270(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_1;                                            // 0x0278(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_2;                                            // 0x0280(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_3;                                            // 0x0288(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_4;                                            // 0x0290(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_AccessKeyID;                                  // 0x0298(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_Alias;                                        // 0x02A0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_SecretID;                                     // 0x02A8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                               EditableText_Session;                                      // 0x02B0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                              HorizontalBox_1;                                           // 0x02B8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                              HorizontalBox_Local;                                       // 0x02C0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                              HorizontalBoxGameliftIPLOGIN;                              // 0x02C8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                      Image_12;                                                  // 0x02D0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                                Panel;                                                     // 0x02D8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPartyPlayer_C*                              PartyPlayer;                                               // 0x02E0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPartyPlayer_C*                              PartyPlayer_6;                                             // 0x02E8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPartyPlayer_C*                              PartyPlayer_7;                                             // 0x02F0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPartyPlayer_C*                              PartyPlayer_8;                                             // 0x02F8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                                  TextBlock_2;                                               // 0x0300(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                                  TextBlock_3;                                               // 0x0308(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                                  TextBlock_1Join;                                           // 0x0310(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_Button_C*                            Widget_Button;                                             // 0x0318(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_FindMatchPanel_C*                    Widget_FindMatchPanel_C_1;                                 // 0x0320(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_Lootbox_C*                           Widget_Lootbox;                                            // 0x0328(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_MainpanelMobile_C*                   Widget_MainpanelMobile_191;                                // 0x0330(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_PlayerProfile_C*                     Widget_PlayerProfile;                                      // 0x0338(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_PlaymodePanel_C*                     Widget_PlaymodePanel;                                      // 0x0340(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_SettingPanelMobile_C*                Widget_SettingPanelMobile;                                 // 0x0348(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                             WidgetSwitcher_Main;                                       // 0x0350(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_MainMenuGameMode_C*                      MainMenuGameMode_REF;                                      // 0x0358(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                                  PreviewClientActor;                                        // 0x0360(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchMakingComponent_C*                     MatchMaking_REF;                                           // 0x0368(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWidgetMainMenuManager_C*                    Widget_Manager;                                            // 0x0370(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UTextBlock*>                          ButtonTextCache;                                           // 0x0378(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UButton*                                     ClickRecently;                                             // 0x0388(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               bBlockMoveMenu;                                            // 0x0390(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = nullptr;
	if (!ptr)
		ptr = 
UObject::FindClass("WidgetBlueprintGeneratedClass Widget_MainMenuGSMobile.Widget_MainMenuGSMobile_C");
		return ptr;
	}



	void BeginMenuAnimation(float* Duration);
	void EndMenuAnimation(float* Duration);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool Get_Play_bIsEnabled_1();
	bool Get_PlayAsSurvivor_bIsEnabled_1();
	bool Get_PlayAsHunter_bIsEnabled_1();
	bool Get_CustomMatch_bIsEnabled_1();
	struct FText Get_PlayTextBox_Text_1();
	UMG_ESlateVisibility Get_Play_Visibility_1();
	struct FText Get_LootBox_Text();
	struct FText Get_Level_Text();
	struct FText Get_Coin_Text();
	void BndEvt__JoinBTN_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Widget_Lootbox_K2Node_ComponentBoundEvent_6_OnBack__DelegateSignature();
	void BndEvt__Widget_Lootbox_K2Node_ComponentBoundEvent_7_OnFindMatch__DelegateSignature();
	void BndEvt__Widget_Lootbox_K2Node_ComponentBoundEvent_8_OnSetting__DelegateSignature();
	void BndEvt__Widget_SettingPanel_K2Node_ComponentBoundEvent_0_OnFindMatch__DelegateSignature();
	void BndEvt__Widget_SettingPanel_K2Node_ComponentBoundEvent_12_OnLootbox__DelegateSignature();
	void BndEvt__Widget_SettingPanel_K2Node_ComponentBoundEvent_13_OnItemStore__DelegateSignature();
	void BndEvt__Widget_SettingPanel_K2Node_ComponentBoundEvent_15_OnExit__DelegateSignature();
	void BndEvt__Widget_PlaymodePanel_K2Node_ComponentBoundEvent_14_OnBack__DelegateSignature();
	void BndEvt__Widget_PlaymodePanel_K2Node_ComponentBoundEvent_17_OnSetting__DelegateSignature();
	void BndEvt__Widget_PlaymodePanel_K2Node_ComponentBoundEvent_18_OnSwitchRole__DelegateSignature();
	void BndEvt__Widget_FindMatchPanel_C_0_K2Node_ComponentBoundEvent_20_OnBack__DelegateSignature();
	void BndEvt__Widget_FindMatchPanel_C_0_K2Node_ComponentBoundEvent_21_OnSetting__DelegateSignature();
	void BndEvt__Widget_FindMatchPanel_C_0_K2Node_ComponentBoundEvent_22_OnSwitchRole__DelegateSignature();
	void BndEvt__Widget_FindMatchPanel_C_0_K2Node_ComponentBoundEvent_23_OnPlayNow__DelegateSignature();
	void BndEvt__Widget_FindMatchPanel_C_0_K2Node_ComponentBoundEvent_1_OnLootbox__DelegateSignature();
	void BndEvt__Widget_MainpanelMobile_190_K2Node_ComponentBoundEvent_2_OnFindMatch__DelegateSignature();
	void BndEvt__Widget_MainpanelMobile_190_K2Node_ComponentBoundEvent_4_OnLootbox__DelegateSignature();
	void BndEvt__Widget_MainpanelMobile_190_K2Node_ComponentBoundEvent_9_OnItemStore__DelegateSignature();
	void BndEvt__Widget_MainpanelMobile_190_K2Node_ComponentBoundEvent_19_OnSetting__DelegateSignature();
	void ShowFindMatch();
	void SwitchRole();
	void ShowMainPanel();
	void ShowPlayNow();
	void ShowLootboxStore();
	void ShowSetting();
	void EndMoveMenu();
	void BeginMoveMenu();
	void ShowItemStore();
	void ShowPlayMode();
	void BackAction();
	void Construct();
	void OnReceiveNotifyPlayerInfo(const struct FPlayerInfoStruct_G& PlayerInfo);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void OnReceiveNotifyPlayerItems(TArray<struct FString>* Items, TArray<int>* Number);
	void ExecuteUbergraph_Widget_MainMenuGSMobile(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
